<?php

namespace Database\Seeders;

use App\Models\FQA;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class FQAseeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $faqs = [
            [
                'question' => 'ما هي المقرأة الليبية للقرآن الكريم وعلومه؟',
                'answer' => 'المقرأة الليبية للقرآن الكريم وعلومه هي مؤسسة تطوعية تُعنى بتعليم القرآن الكريم وعلومه لجميع الشرائح، وقد أُسست في أغسطس من عام 2020. انطلقت تجريبيا في ديسمبر من العام نفسه، وكانت الانطلاقة الفعلية في يناير من عام 2021.'
            ],
            [
                'question' => 'كم عدد الطلاب والمعلمين في المقرأة؟',
                'answer' => 'تضم المقرأة قرابة ألفي طالب وطالبة من مختلف أرجاء المعمورة، كما تضم أكثر من 130 معلمًا ومعلمة.'
            ],
            [
                'question' => 'ما هي الإدارات المختلفة الموجودة في المقرأة؟',
                'answer' => 'تشتمل المقرأة على كادر إداري في إدارتي التحفيظ لقسمي الإناث والذكور، وإدارة التسجيل، وإدارة البيانات، وإدارة الإعلام، وغيرها من الإدارات.'
            ],
            [
                'question' => 'هل تقبل المقرأة طلابًا من غير الناطقين بالعربية؟',
                'answer' => 'نعم، تضمّ المقرأة أيضًا طلبة من غير الناطقين بالعربية.'
            ],
            [
                'question' => 'ما هي الأنشطة المصاحبة التي تشرف عليها المقرأة؟',
                'answer' => 'تشرف المقرأة على مناشط مصاحبة لتعليم القرآن الكريم وعلومه، مثل المخيمات القرآنية لمحفظي ومحفظات المقرأة، والمسابقات الداخلية لطلبة المقرأة. كما تشرف على تصوير ختمات بأصوات القراء الليبيين من مختلف المدن والأعمار.'
            ],
            [
                'question' => 'كيف يمكنني التسجيل في المقرأة؟',
                'answer' => 'يمكنك التسجيل في المقرأة عن طريق زيارة موقعنا الإلكتروني واتباع التعليمات في قسم التسجيل، أو يمكنك الاتصال بإدارة التسجيل للحصول على المزيد من المعلومات.'
            ],
            [
                'question' => 'هل تقدم المقرأة دروسًا عبر الإنترنت؟',
                'answer' => 'نعم، تقدم المقرأة دروسًا عبر الإنترنت لتسهيل عملية التعليم لجميع الطلاب بغض النظر عن مكان إقامتهم.'
            ],
            [
                'question' => 'هل هناك أي رسوم للتسجيل في المقرأة؟',
                'answer' => 'كجزء من رسالتها التطوعية، تقدم المقرأة خدماتها التعليمية بشكل مجاني لجميع الطلاب.'
            ],
        ];

        foreach ($faqs as $faq) {
            FQA::create($faq);
        }
    }
}
